app/controllers/users_controller.rb

  def signin
    puts "\n******* signin *******"
    puts "\n** signin_params.inspect: #{signin_params.inspect} *******"
    @user = User.where(username: signin_params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "xl003"], ["LIMIT", 1]]

  def index
    puts "\n******* index *******"
    @users = User.all
---
SELECT "users".* FROM "users"

  def home
    puts "\n******* home *******"
    @postsArray = []
    @users = User.all
    @users.each do |user|
      posts = user.posts
      if posts.length > 0
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

  def create
    puts "\n******* create *******"
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    puts "\n******* destroy *******"
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]